In [1]:
import pandas as pd
kfc = pd.read_csv("cvs/kfc.csv")
kfc.head()

,id,lon,lat,province,city,name,address,brand,category,birth,all_day,wifi,store_view,basketball,self_service,attractions,train,breakfast
0,15487,116.280940,39.951740,北京市,北京市,板井路,远大路远大居住区二期世纪金源大酒店一层东南角,KFC,餐饮,True,False,False,True,True,True,False,False,True
1,15205,116.362701,39.794070,北京市,北京市,大兴新宫DT,西红门路丙13号一层加二层,KFC,餐饮,True,False,False,True,False,True,False,False,True
2,15184,116.209496,39.752680,北京市,北京市,长阳,长阳镇起步区五号地商业综合体中粮万科半岛商业广场首层L1017A及二层L2030A??,KFC,餐饮,False,False,False,False,False,True,False,False,False
3,15186,116.157956,39.723521,北京市,北京市,良乡长虹东路,拱辰街道东羊庄村18号一层,KFC,餐饮,True,False,False,True,True,True,False,False,True
4,15183,116.220176,40.222182,北京市,北京市,昌平京客隆,西关路20号三号楼京客隆超市一层二层西侧3号商铺,KFC,餐饮,True,False,False,True,True,True,False,False,True

Pandas中 
1、空  NaN
2、字符串操作
3、正则表达式
4、时间转换

In [2]:
import datetime
dt = pd.Timestamp(datetime.datetime(2020, 3, 13))
print(dt)

dt1 = pd.Timestamp("2021-1-12")
print(dt1)

dt2 = pd.Timestamp(2022, 2, 14)
print(dt2)

2020-03-13 00:00:00
2021-01-12 00:00:00
2022-02-14 00:00:00

In [3]:
dt = pd.Period("2020-01")
print(dt)
dt1 = pd.Period("2020-01-09", freq="D")
print(dt1)
dt2 = pd.Period("2020-01-09", freq="M")
print(dt2)
dt3 = pd.Period("2020-01-09", freq="Q")
print(dt3)
dt4 = pd.Period("2020q4", freq="Q")
print(dt4)

2020-01
2020-01-09
2020-01
2020Q1
2020Q4

In [4]:
str_series = pd.Series(["一", "二", "五"])
print(str_series)

def trans_cn_num(s):
    dic = {
        "一": 1,
        "二": 2,
        "三": 3,
        "四": 4,
        "五": 5,
        "六": 6,
        "七": 7,
        "八": 8,
        "九": 9,
        "十": 10,
    }
    if s in dic:
        return dic[s]
    else:
        return None


num_series = str_series.map(trans_cn_num)
print(num_series)

0    一
1    二
2    五
dtype: object
0    1
1    2
2    5
dtype: int64

显示索引：b.loc[1:3]  左闭右闭  从索引1到索引3之间的所有
隐式索引：b.iloc[1:3] 左闭右开  从第二行到第四行

层级索引，多个维度

In [23]:
import numpy as np
data = pd.Series(np.arange(6), 
                index = [
                    ["SH", "SH", "BJ", "BJ", "HZ", "HZ"],
                    [2000, 2001, 2000, 2001, 2000, 2001]
                ])

data.index.names = ["city", "year"]
data

city  year
SH    2000    0
      2001    1
BJ    2000    2
      2001    3
HZ    2000    4
      2001    5
dtype: int32

查看索引

In [24]:
data.index

MultiIndex([('SH', 2000),
            ('SH', 2001),
            ('BJ', 2000),
            ('BJ', 2001),
            ('HZ', 2000),
            ('HZ', 2001)],
           names=['city', 'year'])

查询层级个数

In [25]:
data.index.nlevels

2

列出某个维度的索引的所有值

In [26]:
data.index.get_level_values(0)

Index(['SH', 'SH', 'BJ', 'BJ', 'HZ', 'HZ'], dtype='object', name='city')

In [27]:
data.index.get_level_values("city")

Index(['SH', 'SH', 'BJ', 'BJ', 'HZ', 'HZ'], dtype='object', name='city')

索引的取值的唯一值

In [28]:
data.index.unique(1)

Int64Index([2000, 2001], dtype='int64', name='year')

In [29]:
data.index.unique("year")

Int64Index([2000, 2001], dtype='int64', name='year')

获取单个元素

In [30]:
data["SH", 2001]

1

获取一个城市的数据

In [31]:
data["SH"]

year
2000    0
2001    1
dtype: int32

获取某一年份的数据

In [32]:
data[:, 2001]

city
SH    1
BJ    3
HZ    5
dtype: int32

数据框

In [33]:
goals = pd.Series([35, 10, 3], index=["Messi", "Suarez", "Pique"])
passes = pd.Series([55, 40, 60], index=["Messi", "Suarez", "Xavi"])

data = pd.DataFrame({"goals": goals, "passes": passes})
data.index.name = "name"
data.head()

        goals  passes
name
Messi    35.0    55.0
Pique     3.0     NaN
Suarez   10.0    40.0
Xavi      NaN    60.0

In [34]:
players = [{
        'name': 'Messi',
        'goals': 35,
        'passes': 55
    },{
        'name': 'Suarez',
        'goals': 10,
        'passes': 40
    },{
        'name': 'Pique',
        'goals': 3
    },{
        'name': 'Xavi',
        'passes': 60
    }
]
data = pd.DataFrame(players)
data.head()

     name  goals  passes
0   Messi   35.0    55.0
1  Suarez   10.0    40.0
2   Pique    3.0     NaN
3    Xavi    NaN    60.0

In [35]:
data = data.set_index('name')
print(data.index)
data.head()

Index(['Messi', 'Suarez', 'Pique', 'Xavi'], dtype='object', name='name')

        goals  passes
name
Messi    35.0    55.0
Suarez   10.0    40.0
Pique     3.0     NaN
Xavi      NaN    60.0

In [36]:
data.columns

Index(['goals', 'passes'], dtype='object')

In [37]:
data['goals']

name
Messi     35.0
Suarez    10.0
Pique      3.0
Xavi       NaN
Name: goals, dtype: float64

转置操作

In [38]:
data.transpose()

name    Messi  Suarez  Pique  Xavi
goals    35.0    10.0    3.0   NaN
passes   55.0    40.0    NaN  60.0

In [39]:
log_data = np.log(data)
log_data

           goals    passes
name
Messi   3.555348  4.007333
Suarez  2.302585  3.688879
Pique   1.098612       NaN
Xavi         NaN  4.094345

In [40]:
data + log_data

            goals     passes
name
Messi   38.555348  59.007333
Suarez  12.302585  43.688879
Pique    4.098612        NaN
Xavi          NaN  64.094345

在原来的DataFrame中添加一列

In [41]:
data['log_goals'] = np.log(data['goals'])
data

        goals  passes  log_goals
name
Messi    35.0    55.0   3.555348
Suarez   10.0    40.0   2.302585
Pique     3.0     NaN   1.098612
Xavi      NaN    60.0        NaN

删除数据

In [42]:
log_data2 = log_data.drop("Xavi")
log_data2.head()

           goals    passes
name
Messi   3.555348  4.007333
Suarez  2.302585  3.688879
Pique   1.098612       NaN

删除某一列，需要添加axis=1，这个操作不会影响原来的数据

In [43]:
log_data2 = log_data.drop('passes', axis=1)
log_data2.head()

           goals
name
Messi   3.555348
Suarez  2.302585
Pique   1.098612
Xavi         NaN

In [44]:
log_data.head()

           goals    passes
name
Messi   3.555348  4.007333
Suarez  2.302585  3.688879
Pique   1.098612       NaN
Xavi         NaN  4.094345

彻底删除

In [45]:
del log_data['passes']
log_data.head()

           goals
name
Messi   3.555348
Suarez  2.302585
Pique   1.098612
Xavi         NaN

In [47]:
data.isnull()

        goals  passes  log_goals
name
Messi   False   False      False
Suarez  False   False      False
Pique   False    True      False
Xavi     True   False       True

把任何有缺失值的行都删掉

In [48]:
data_copy = data
data_copy.dropna()

        goals  passes  log_goals
name
Messi    35.0    55.0   3.555348
Suarez   10.0    40.0   2.302585

删除缺失值得列

In [49]:
data_copy = data
data_copy.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [Messi, Suarez, Pique, Xavi]

填充缺失值

In [51]:
data1 = data.fillna(0)
data1

        goals  passes  log_goals
name
Messi    35.0    55.0   3.555348
Suarez   10.0    40.0   2.302585
Pique     3.0     0.0   1.098612
Xavi      0.0    60.0   0.000000

选取数据

In [54]:
data['goals']['Messi']

35.0

In [55]:
data[['goals', 'passes']]

        goals  passes
name
Messi    35.0    55.0
Suarez   10.0    40.0
Pique     3.0     NaN
Xavi      NaN    60.0

In [52]:
data['Messi': 'Pique']

        goals  passes  log_goals
name
Messi    35.0    55.0   3.555348
Suarez   10.0    40.0   2.302585
Pique     3.0     NaN   1.098612

In [53]:
data[data['goals'] >= 10]

        goals  passes  log_goals
name
Messi    35.0    55.0   3.555348
Suarez   10.0    40.0   2.302585

显示索引

In [56]:
data.loc['Messi': 'Suarez', 'goals': 'passes']

        goals  passes
name
Messi    35.0    55.0
Suarez   10.0    40.0

隐式索引

In [57]:
data.iloc[:2, 1:]

        passes  log_goals
name
Messi     55.0   3.555348
Suarez    40.0   2.302585

数据排序

In [58]:
data.sort_values('goals')

        goals  passes  log_goals
name
Pique     3.0     NaN   1.098612
Suarez   10.0    40.0   2.302585
Messi    35.0    55.0   3.555348
Xavi      NaN    60.0        NaN

In [59]:
data.sort_values(['goals', 'passes'], ascending=[False, True])

        goals  passes  log_goals
name
Messi    35.0    55.0   3.555348
Suarez   10.0    40.0   2.302585
Pique     3.0     NaN   1.098612
Xavi      NaN    60.0        NaN

合并数据  merge
描述性统计 describe()
数据加总与转换